Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/sercom.h
#define SERCOM_USART_CTRLA_SWRST_Pos          _UINT32_(0)                                          /* (SERCOM_USART_CTRLA) Software Reset Position */
#define SERCOM_USART_CTRLA_SWRST_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLA_SWRST_Pos)      /* (SERCOM_USART_CTRLA) Software Reset Mask */
#define SERCOM_USART_CTRLA_SWRST(value)       (SERCOM_USART_CTRLA_SWRST_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_ENABLE_Pos         _UINT32_(1)                                          /* (SERCOM_USART_CTRLA) Enable Position */
#define SERCOM_USART_CTRLA_ENABLE_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLA_ENABLE_Pos)     /* (SERCOM_USART_CTRLA) Enable Mask */
#define SERCOM_USART_CTRLA_ENABLE(value)      (SERCOM_USART_CTRLA_ENABLE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_MODE_Pos           _UINT32_(2)                                          /* (SERCOM_USART_CTRLA) Operating Mode Position */
#define SERCOM_USART_CTRLA_MODE_Msk           (_UINT32_(0x7) << SERCOM_USART_CTRLA_MODE_Pos)       /* (SERCOM_USART_CTRLA) Operating Mode Mask */
#define SERCOM_USART_CTRLA_MODE(value)        (SERCOM_USART_CTRLA_MODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_MODE_Pos)) /* Assignment of value for MODE in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_MODE_EXTCLK_Val  _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) USART with external clock  */
#define   SERCOM_USART_CTRLA_MODE_INTCLK_Val  _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) Usart with internal clock  */
#define SERCOM_USART_CTRLA_MODE_EXTCLK        (SERCOM_USART_CTRLA_MODE_EXTCLK_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) USART with external clock Position */
#define SERCOM_USART_CTRLA_MODE_INTCLK        (SERCOM_USART_CTRLA_MODE_INTCLK_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) Usart with internal clock Position */
#define SERCOM_USART_CTRLA_RUNSTDBY_Pos       _UINT32_(7)                                          /* (SERCOM_USART_CTRLA) Run during Standby Position */
#define SERCOM_USART_CTRLA_RUNSTDBY_Msk       (_UINT32_(0x1) << SERCOM_USART_CTRLA_RUNSTDBY_Pos)   /* (SERCOM_USART_CTRLA) Run during Standby Mask */
#define SERCOM_USART_CTRLA_RUNSTDBY(value)    (SERCOM_USART_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_IBON_Pos           _UINT32_(8)                                          /* (SERCOM_USART_CTRLA) Immediate Buffer Overflow Notification Position */
#define SERCOM_USART_CTRLA_IBON_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLA_IBON_Pos)       /* (SERCOM_USART_CTRLA) Immediate Buffer Overflow Notification Mask */
#define SERCOM_USART_CTRLA_IBON(value)        (SERCOM_USART_CTRLA_IBON_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_IBON_Pos)) /* Assignment of value for IBON in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_TXINV_Pos          _UINT32_(9)                                          /* (SERCOM_USART_CTRLA) Transmit Data Invert Position */
#define SERCOM_USART_CTRLA_TXINV_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLA_TXINV_Pos)      /* (SERCOM_USART_CTRLA) Transmit Data Invert Mask */
#define SERCOM_USART_CTRLA_TXINV(value)       (SERCOM_USART_CTRLA_TXINV_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_TXINV_Pos)) /* Assignment of value for TXINV in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_TXINV_DISABLE_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) TxD is not inverted  */
#define   SERCOM_USART_CTRLA_TXINV_INV_Val    _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) TxD is inverted  */
#define SERCOM_USART_CTRLA_TXINV_DISABLE      (SERCOM_USART_CTRLA_TXINV_DISABLE_Val << SERCOM_USART_CTRLA_TXINV_Pos) /* (SERCOM_USART_CTRLA) TxD is not inverted Position */
#define SERCOM_USART_CTRLA_TXINV_INV          (SERCOM_USART_CTRLA_TXINV_INV_Val << SERCOM_USART_CTRLA_TXINV_Pos) /* (SERCOM_USART_CTRLA) TxD is inverted Position */
#define SERCOM_USART_CTRLA_RXINV_Pos          _UINT32_(10)                                         /* (SERCOM_USART_CTRLA) Receive Data Invert Position */
#define SERCOM_USART_CTRLA_RXINV_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLA_RXINV_Pos)      /* (SERCOM_USART_CTRLA) Receive Data Invert Mask */
#define SERCOM_USART_CTRLA_RXINV(value)       (SERCOM_USART_CTRLA_RXINV_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_RXINV_Pos)) /* Assignment of value for RXINV in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_RXINV_DISABLE_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) RxD is not inverted  */
#define   SERCOM_USART_CTRLA_RXINV_INV_Val    _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) RxD is inverted  */
#define SERCOM_USART_CTRLA_RXINV_DISABLE      (SERCOM_USART_CTRLA_RXINV_DISABLE_Val << SERCOM_USART_CTRLA_RXINV_Pos) /* (SERCOM_USART_CTRLA) RxD is not inverted Position */
#define SERCOM_USART_CTRLA_RXINV_INV          (SERCOM_USART_CTRLA_RXINV_INV_Val << SERCOM_USART_CTRLA_RXINV_Pos) /* (SERCOM_USART_CTRLA) RxD is inverted Position */
#define SERCOM_USART_CTRLA_SAMPR_Pos          _UINT32_(13)                                         /* (SERCOM_USART_CTRLA) Sample Position */
#define SERCOM_USART_CTRLA_SAMPR_Msk          (_UINT32_(0x7) << SERCOM_USART_CTRLA_SAMPR_Pos)      /* (SERCOM_USART_CTRLA) Sample Mask */
#define SERCOM_USART_CTRLA_SAMPR(value)       (SERCOM_USART_CTRLA_SAMPR_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_SAMPR_Pos)) /* Assignment of value for SAMPR in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_SAMPR_ARITHM16X_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) 16x oversampling using arithmetic baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_FRAC16X_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) 16x oversampling using fractional baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_ARITHM8X_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) 8x oversampling using arithmetic baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_FRAC8X_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) 8x oversampling using fractional baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_ARITHM3X_Val _UINT32_(0x4)                                        /* (SERCOM_USART_CTRLA) 3x oversampling using arithmetic baud rate generation  */
#define SERCOM_USART_CTRLA_SAMPR_ARITHM16X    (SERCOM_USART_CTRLA_SAMPR_ARITHM16X_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 16x oversampling using arithmetic baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_FRAC16X      (SERCOM_USART_CTRLA_SAMPR_FRAC16X_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 16x oversampling using fractional baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_ARITHM8X     (SERCOM_USART_CTRLA_SAMPR_ARITHM8X_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 8x oversampling using arithmetic baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_FRAC8X       (SERCOM_USART_CTRLA_SAMPR_FRAC8X_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 8x oversampling using fractional baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_ARITHM3X     (SERCOM_USART_CTRLA_SAMPR_ARITHM3X_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 3x oversampling using arithmetic baud rate generation Position */
#define SERCOM_USART_CTRLA_TXPO_Pos           _UINT32_(16)                                         /* (SERCOM_USART_CTRLA) Transmit Data Pinout Position */
#define SERCOM_USART_CTRLA_TXPO_Msk           (_UINT32_(0x3) << SERCOM_USART_CTRLA_TXPO_Pos)       /* (SERCOM_USART_CTRLA) Transmit Data Pinout Mask */
#define SERCOM_USART_CTRLA_TXPO(value)        (SERCOM_USART_CTRLA_TXPO_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_TXPO_Pos)) /* Assignment of value for TXPO in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_TXPO_PAD0_Val    _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) PAD[0] = TxD; PAD[1] = XCK  */
#define   SERCOM_USART_CTRLA_TXPO_PAD2_Val    _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS  */
#define   SERCOM_USART_CTRLA_TXPO_PAD3_Val    _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) PAD[0] = TxD; PAD[1] = XCK; PAD[2] = TE  */
#define SERCOM_USART_CTRLA_TXPO_PAD0          (SERCOM_USART_CTRLA_TXPO_PAD0_Val << SERCOM_USART_CTRLA_TXPO_Pos) /* (SERCOM_USART_CTRLA) PAD[0] = TxD; PAD[1] = XCK Position */
#define SERCOM_USART_CTRLA_TXPO_PAD2          (SERCOM_USART_CTRLA_TXPO_PAD2_Val << SERCOM_USART_CTRLA_TXPO_Pos) /* (SERCOM_USART_CTRLA) PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS Position */
#define SERCOM_USART_CTRLA_TXPO_PAD3          (SERCOM_USART_CTRLA_TXPO_PAD3_Val << SERCOM_USART_CTRLA_TXPO_Pos) /* (SERCOM_USART_CTRLA) PAD[0] = TxD; PAD[1] = XCK; PAD[2] = TE Position */
#define SERCOM_USART_CTRLA_RXPO_Pos           _UINT32_(20)                                         /* (SERCOM_USART_CTRLA) Receive Data Pinout Position */
#define SERCOM_USART_CTRLA_RXPO_Msk           (_UINT32_(0x3) << SERCOM_USART_CTRLA_RXPO_Pos)       /* (SERCOM_USART_CTRLA) Receive Data Pinout Mask */
#define SERCOM_USART_CTRLA_RXPO(value)        (SERCOM_USART_CTRLA_RXPO_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_RXPO_Pos)) /* Assignment of value for RXPO in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_RXPO_PAD0_Val    _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD0 is used for data reception  */
#define   SERCOM_USART_CTRLA_RXPO_PAD1_Val    _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD1 is used for data reception  */
#define   SERCOM_USART_CTRLA_RXPO_PAD2_Val    _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD2 is used for data reception  */
#define   SERCOM_USART_CTRLA_RXPO_PAD3_Val    _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD3 is used for data reception  */
#define SERCOM_USART_CTRLA_RXPO_PAD0          (SERCOM_USART_CTRLA_RXPO_PAD0_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD0 is used for data reception Position */
#define SERCOM_USART_CTRLA_RXPO_PAD1          (SERCOM_USART_CTRLA_RXPO_PAD1_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD1 is used for data reception Position */
#define SERCOM_USART_CTRLA_RXPO_PAD2          (SERCOM_USART_CTRLA_RXPO_PAD2_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD2 is used for data reception Position */
#define SERCOM_USART_CTRLA_RXPO_PAD3          (SERCOM_USART_CTRLA_RXPO_PAD3_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD3 is used for data reception Position */
#define SERCOM_USART_CTRLA_SAMPA_Pos          _UINT32_(22)                                         /* (SERCOM_USART_CTRLA) Sample Adjustment Position */
#define SERCOM_USART_CTRLA_SAMPA_Msk          (_UINT32_(0x3) << SERCOM_USART_CTRLA_SAMPA_Pos)      /* (SERCOM_USART_CTRLA) Sample Adjustment Mask */
#define SERCOM_USART_CTRLA_SAMPA(value)       (SERCOM_USART_CTRLA_SAMPA_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_SAMPA_Pos)) /* Assignment of value for SAMPA in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_FORM_Pos           _UINT32_(24)                                         /* (SERCOM_USART_CTRLA) Frame Format Position */
#define SERCOM_USART_CTRLA_FORM_Msk           (_UINT32_(0xF) << SERCOM_USART_CTRLA_FORM_Pos)       /* (SERCOM_USART_CTRLA) Frame Format Mask */
#define SERCOM_USART_CTRLA_FORM(value)        (SERCOM_USART_CTRLA_FORM_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_FORM_Pos)) /* Assignment of value for FORM in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_FORM_USART_Val   _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) USART frame  */
#define   SERCOM_USART_CTRLA_FORM_USARTP_Val  _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) USART frame with parity  */
#define   SERCOM_USART_CTRLA_FORM_LINBRKGEN_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) LIN Master Break and Synck generation  */
#define   SERCOM_USART_CTRLA_FORM_LINBRKDET_Val _UINT32_(0x4)                                        /* (SERCOM_USART_CTRLA) LIN Slave break detection and auto-baud  */
#define   SERCOM_USART_CTRLA_FORM_BRKDET_Val  _UINT32_(0x5)                                        /* (SERCOM_USART_CTRLA) Break detection and auto-baud with parity  */
#define SERCOM_USART_CTRLA_FORM_USART         (SERCOM_USART_CTRLA_FORM_USART_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) USART frame Position */
#define SERCOM_USART_CTRLA_FORM_USARTP        (SERCOM_USART_CTRLA_FORM_USARTP_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) USART frame with parity Position */
#define SERCOM_USART_CTRLA_FORM_LINBRKGEN     (SERCOM_USART_CTRLA_FORM_LINBRKGEN_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) LIN Master Break and Synck generation Position */
#define SERCOM_USART_CTRLA_FORM_LINBRKDET     (SERCOM_USART_CTRLA_FORM_LINBRKDET_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) LIN Slave break detection and auto-baud Position */
#define SERCOM_USART_CTRLA_FORM_BRKDET        (SERCOM_USART_CTRLA_FORM_BRKDET_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) Break detection and auto-baud with parity Position */
#define SERCOM_USART_CTRLA_CMODE_Pos          _UINT32_(28)                                         /* (SERCOM_USART_CTRLA) Communication Mode Position */
#define SERCOM_USART_CTRLA_CMODE_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLA_CMODE_Pos)      /* (SERCOM_USART_CTRLA) Communication Mode Mask */
#define SERCOM_USART_CTRLA_CMODE(value)       (SERCOM_USART_CTRLA_CMODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_CMODE_Pos)) /* Assignment of value for CMODE in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_CMODE_ASYNC_Val  _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) Asynchronous communication.  */
#define   SERCOM_USART_CTRLA_CMODE_SYNC_Val   _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) Synchronous communication.  */
#define SERCOM_USART_CTRLA_CMODE_ASYNC        (SERCOM_USART_CTRLA_CMODE_ASYNC_Val << SERCOM_USART_CTRLA_CMODE_Pos) /* (SERCOM_USART_CTRLA) Asynchronous communication. Position */
#define SERCOM_USART_CTRLA_CMODE_SYNC         (SERCOM_USART_CTRLA_CMODE_SYNC_Val << SERCOM_USART_CTRLA_CMODE_Pos) /* (SERCOM_USART_CTRLA) Synchronous communication. Position */
#define SERCOM_USART_CTRLA_CPOL_Pos           _UINT32_(29)                                         /* (SERCOM_USART_CTRLA) Clock Polarity Position */
#define SERCOM_USART_CTRLA_CPOL_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLA_CPOL_Pos)       /* (SERCOM_USART_CTRLA) Clock Polarity Mask */
#define SERCOM_USART_CTRLA_CPOL(value)        (SERCOM_USART_CTRLA_CPOL_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_CPOL_Pos)) /* Assignment of value for CPOL in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_DORD_Pos           _UINT32_(30)                                         /* (SERCOM_USART_CTRLA) Data Order Position */
#define SERCOM_USART_CTRLA_DORD_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLA_DORD_Pos)       /* (SERCOM_USART_CTRLA) Data Order Mask */
#define SERCOM_USART_CTRLA_DORD(value)        (SERCOM_USART_CTRLA_DORD_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_DORD_Pos)) /* Assignment of value for DORD in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_DORD_MSB_Val     _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) MSB is transmitted first.  */
#define   SERCOM_USART_CTRLA_DORD_LSB_Val     _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) LSB is transmitted first.  */
#define SERCOM_USART_CTRLA_DORD_MSB           (SERCOM_USART_CTRLA_DORD_MSB_Val << SERCOM_USART_CTRLA_DORD_Pos) /* (SERCOM_USART_CTRLA) MSB is transmitted first. Position */
#define SERCOM_USART_CTRLA_DORD_LSB           (SERCOM_USART_CTRLA_DORD_LSB_Val << SERCOM_USART_CTRLA_DORD_Pos) /* (SERCOM_USART_CTRLA) LSB is transmitted first. Position */
#define SERCOM_USART_CTRLA_Msk                _UINT32_(0x7FF3E79F)                                 /* (SERCOM_USART_CTRLA) Register Mask  */


