Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/sercom.h
#define SERCOM_SPI_CTRLB_CHSIZE_Pos           _UINT32_(0)                                          /* (SERCOM_SPI_CTRLB) Character Size Position */
#define SERCOM_SPI_CTRLB_CHSIZE_Msk           (_UINT32_(0x7) << SERCOM_SPI_CTRLB_CHSIZE_Pos)       /* (SERCOM_SPI_CTRLB) Character Size Mask */
#define SERCOM_SPI_CTRLB_CHSIZE(value)        (SERCOM_SPI_CTRLB_CHSIZE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_CHSIZE_Pos)) /* Assignment of value for CHSIZE in the SERCOM_SPI_CTRLB register */
#define   SERCOM_SPI_CTRLB_CHSIZE_8BITS_Val   _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLB) 8-bits character  */
#define   SERCOM_SPI_CTRLB_CHSIZE_9BITS_Val   _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLB) 9-bits character  */
#define SERCOM_SPI_CTRLB_CHSIZE_8BITS         (SERCOM_SPI_CTRLB_CHSIZE_8BITS_Val << SERCOM_SPI_CTRLB_CHSIZE_Pos) /* (SERCOM_SPI_CTRLB) 8-bits character Position */
#define SERCOM_SPI_CTRLB_CHSIZE_9BITS         (SERCOM_SPI_CTRLB_CHSIZE_9BITS_Val << SERCOM_SPI_CTRLB_CHSIZE_Pos) /* (SERCOM_SPI_CTRLB) 9-bits character Position */
#define SERCOM_SPI_CTRLB_PLOADEN_Pos          _UINT32_(6)                                          /* (SERCOM_SPI_CTRLB) Data Preload Enable Position */
#define SERCOM_SPI_CTRLB_PLOADEN_Msk          (_UINT32_(0x1) << SERCOM_SPI_CTRLB_PLOADEN_Pos)      /* (SERCOM_SPI_CTRLB) Data Preload Enable Mask */
#define SERCOM_SPI_CTRLB_PLOADEN(value)       (SERCOM_SPI_CTRLB_PLOADEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_PLOADEN_Pos)) /* Assignment of value for PLOADEN in the SERCOM_SPI_CTRLB register */
#define SERCOM_SPI_CTRLB_SSDE_Pos             _UINT32_(9)                                          /* (SERCOM_SPI_CTRLB) Slave Select Low Detect Enable Position */
#define SERCOM_SPI_CTRLB_SSDE_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLB_SSDE_Pos)         /* (SERCOM_SPI_CTRLB) Slave Select Low Detect Enable Mask */
#define SERCOM_SPI_CTRLB_SSDE(value)          (SERCOM_SPI_CTRLB_SSDE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_SSDE_Pos)) /* Assignment of value for SSDE in the SERCOM_SPI_CTRLB register */
#define   SERCOM_SPI_CTRLB_SSDE_DISABLE_Val   _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLB) SS low detector is disabled  */
#define   SERCOM_SPI_CTRLB_SSDE_ENABLE_Val    _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLB) SS low detector is enabled  */
#define SERCOM_SPI_CTRLB_SSDE_DISABLE         (SERCOM_SPI_CTRLB_SSDE_DISABLE_Val << SERCOM_SPI_CTRLB_SSDE_Pos) /* (SERCOM_SPI_CTRLB) SS low detector is disabled Position */
#define SERCOM_SPI_CTRLB_SSDE_ENABLE          (SERCOM_SPI_CTRLB_SSDE_ENABLE_Val << SERCOM_SPI_CTRLB_SSDE_Pos) /* (SERCOM_SPI_CTRLB) SS low detector is enabled Position */
#define SERCOM_SPI_CTRLB_MSSEN_Pos            _UINT32_(13)                                         /* (SERCOM_SPI_CTRLB) Master Slave Select Enable Position */
#define SERCOM_SPI_CTRLB_MSSEN_Msk            (_UINT32_(0x1) << SERCOM_SPI_CTRLB_MSSEN_Pos)        /* (SERCOM_SPI_CTRLB) Master Slave Select Enable Mask */
#define SERCOM_SPI_CTRLB_MSSEN(value)         (SERCOM_SPI_CTRLB_MSSEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_MSSEN_Pos)) /* Assignment of value for MSSEN in the SERCOM_SPI_CTRLB register */
#define   SERCOM_SPI_CTRLB_MSSEN_DISABLE_Val  _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLB) Hardware SS control is disabled  */
#define   SERCOM_SPI_CTRLB_MSSEN_ENABLE_Val   _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLB) Hardware SS control is enabled  */
#define SERCOM_SPI_CTRLB_MSSEN_DISABLE        (SERCOM_SPI_CTRLB_MSSEN_DISABLE_Val << SERCOM_SPI_CTRLB_MSSEN_Pos) /* (SERCOM_SPI_CTRLB) Hardware SS control is disabled Position */
#define SERCOM_SPI_CTRLB_MSSEN_ENABLE         (SERCOM_SPI_CTRLB_MSSEN_ENABLE_Val << SERCOM_SPI_CTRLB_MSSEN_Pos) /* (SERCOM_SPI_CTRLB) Hardware SS control is enabled Position */
#define SERCOM_SPI_CTRLB_AMODE_Pos            _UINT32_(14)                                         /* (SERCOM_SPI_CTRLB) Address Mode Position */
#define SERCOM_SPI_CTRLB_AMODE_Msk            (_UINT32_(0x3) << SERCOM_SPI_CTRLB_AMODE_Pos)        /* (SERCOM_SPI_CTRLB) Address Mode Mask */
#define SERCOM_SPI_CTRLB_AMODE(value)         (SERCOM_SPI_CTRLB_AMODE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_AMODE_Pos)) /* Assignment of value for AMODE in the SERCOM_SPI_CTRLB register */
#define   SERCOM_SPI_CTRLB_AMODE_MASK_Val     _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLB) ADDRMASK is used as a mask to the AADR register  */
#define   SERCOM_SPI_CTRLB_AMODE_2ADDRS_Val   _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLB) The slave responds to the two unique addresses in ADDR and ADDRMASK  */
#define   SERCOM_SPI_CTRLB_AMODE_RANGE_Val    _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLB) The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit  */
#define SERCOM_SPI_CTRLB_AMODE_MASK           (SERCOM_SPI_CTRLB_AMODE_MASK_Val << SERCOM_SPI_CTRLB_AMODE_Pos) /* (SERCOM_SPI_CTRLB) ADDRMASK is used as a mask to the AADR register Position */
#define SERCOM_SPI_CTRLB_AMODE_2ADDRS         (SERCOM_SPI_CTRLB_AMODE_2ADDRS_Val << SERCOM_SPI_CTRLB_AMODE_Pos) /* (SERCOM_SPI_CTRLB) The slave responds to the two unique addresses in ADDR and ADDRMASK Position */
#define SERCOM_SPI_CTRLB_AMODE_RANGE          (SERCOM_SPI_CTRLB_AMODE_RANGE_Val << SERCOM_SPI_CTRLB_AMODE_Pos) /* (SERCOM_SPI_CTRLB) The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit Position */
#define SERCOM_SPI_CTRLB_RXEN_Pos             _UINT32_(17)                                         /* (SERCOM_SPI_CTRLB) Receiver Enable Position */
#define SERCOM_SPI_CTRLB_RXEN_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLB_RXEN_Pos)         /* (SERCOM_SPI_CTRLB) Receiver Enable Mask */
#define SERCOM_SPI_CTRLB_RXEN(value)          (SERCOM_SPI_CTRLB_RXEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_RXEN_Pos)) /* Assignment of value for RXEN in the SERCOM_SPI_CTRLB register */
#define SERCOM_SPI_CTRLB_FIFOCLR_Pos          _UINT32_(22)                                         /* (SERCOM_SPI_CTRLB) FIFO Clear Position */
#define SERCOM_SPI_CTRLB_FIFOCLR_Msk          (_UINT32_(0x3) << SERCOM_SPI_CTRLB_FIFOCLR_Pos)      /* (SERCOM_SPI_CTRLB) FIFO Clear Mask */
#define SERCOM_SPI_CTRLB_FIFOCLR(value)       (SERCOM_SPI_CTRLB_FIFOCLR_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLB_FIFOCLR_Pos)) /* Assignment of value for FIFOCLR in the SERCOM_SPI_CTRLB register */
#define   SERCOM_SPI_CTRLB_FIFOCLR_NONE_Val   _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLB) No action  */
#define   SERCOM_SPI_CTRLB_FIFOCLR_TXFIFO_Val _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLB) Clear TX FIFO  */
#define   SERCOM_SPI_CTRLB_FIFOCLR_RXFIFO_Val _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLB) Clear RX FIFO  */
#define   SERCOM_SPI_CTRLB_FIFOCLR_BOTH_Val   _UINT32_(0x3)                                        /* (SERCOM_SPI_CTRLB) Clear both TX and RF FIFOs  */
#define SERCOM_SPI_CTRLB_FIFOCLR_NONE         (SERCOM_SPI_CTRLB_FIFOCLR_NONE_Val << SERCOM_SPI_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPI_CTRLB) No action Position */
#define SERCOM_SPI_CTRLB_FIFOCLR_TXFIFO       (SERCOM_SPI_CTRLB_FIFOCLR_TXFIFO_Val << SERCOM_SPI_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPI_CTRLB) Clear TX FIFO Position */
#define SERCOM_SPI_CTRLB_FIFOCLR_RXFIFO       (SERCOM_SPI_CTRLB_FIFOCLR_RXFIFO_Val << SERCOM_SPI_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPI_CTRLB) Clear RX FIFO Position */
#define SERCOM_SPI_CTRLB_FIFOCLR_BOTH         (SERCOM_SPI_CTRLB_FIFOCLR_BOTH_Val << SERCOM_SPI_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPI_CTRLB) Clear both TX and RF FIFOs Position */
#define SERCOM_SPI_CTRLB_Msk                  _UINT32_(0x00C2E247)                                 /* (SERCOM_SPI_CTRLB) Register Mask  */


/* -------- SERCOM_USART_CTRLB : (SERCOM Offset: 0x04) (R/W 32) USART Control B -------- */
#define SERCOM_USART_CTRLB_RESETVALUE         _UINT32_(0x00)                                       /*  (SERCOM_USART_CTRLB) USART Control B  Reset Value */

