Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/sercom.h
#define SERCOM_I2CM_CTRLC_DATA32B_Pos         _UINT32_(24)                                         /* (SERCOM_I2CM_CTRLC) Data 32 Bit Position */
#define SERCOM_I2CM_CTRLC_DATA32B_Msk         (_UINT32_(0x1) << SERCOM_I2CM_CTRLC_DATA32B_Pos)     /* (SERCOM_I2CM_CTRLC) Data 32 Bit Mask */
#define SERCOM_I2CM_CTRLC_DATA32B(value)      (SERCOM_I2CM_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_DATA32B_Pos)) /* Assignment of value for DATA32B in the SERCOM_I2CM_CTRLC register */
#define SERCOM_I2CM_CTRLC_FIFOEN_Pos          _UINT32_(27)                                         /* (SERCOM_I2CM_CTRLC) FIFO Enable Position */
#define SERCOM_I2CM_CTRLC_FIFOEN_Msk          (_UINT32_(0x1) << SERCOM_I2CM_CTRLC_FIFOEN_Pos)      /* (SERCOM_I2CM_CTRLC) FIFO Enable Mask */
#define SERCOM_I2CM_CTRLC_FIFOEN(value)       (SERCOM_I2CM_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_FIFOEN_Pos)) /* Assignment of value for FIFOEN in the SERCOM_I2CM_CTRLC register */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_Pos        _UINT32_(28)                                         /* (SERCOM_I2CM_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos)    /* (SERCOM_I2CM_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_I2CM_CTRLC_RXTRHOLD(value)     (SERCOM_I2CM_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos)) /* Assignment of value for RXTRHOLD in the SERCOM_I2CM_CTRLC register */
#define   SERCOM_I2CM_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_I2CM_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_I2CM_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_DEFAULT    (SERCOM_I2CM_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_HALF       (SERCOM_I2CM_CTRLC_RXTRHOLD_HALF_Val << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_FULL       (SERCOM_I2CM_CTRLC_RXTRHOLD_FULL_Val << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_Pos        _UINT32_(30)                                         /* (SERCOM_I2CM_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos)    /* (SERCOM_I2CM_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_I2CM_CTRLC_TXTRHOLD(value)     (SERCOM_I2CM_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos)) /* Assignment of value for TXTRHOLD in the SERCOM_I2CM_CTRLC register */
#define   SERCOM_I2CM_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_I2CM_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_I2CM_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_DEFAULT    (SERCOM_I2CM_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_HALF       (SERCOM_I2CM_CTRLC_TXTRHOLD_HALF_Val << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_EMPTY      (SERCOM_I2CM_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position */
#define SERCOM_I2CM_CTRLC_Msk                 _UINT32_(0xF9000000)                                 /* (SERCOM_I2CM_CTRLC) Register Mask  */


/* -------- SERCOM_I2CS_CTRLC : (SERCOM Offset: 0x08) (R/W 32) I2CS Control C -------- */
#define SERCOM_I2CS_CTRLC_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_I2CS_CTRLC) I2CS Control C  Reset Value */

#define SERCOM_I2CS_CTRLC_SDASETUP_Pos        _UINT32_(0)                                          /* (SERCOM_I2CS_CTRLC) SDA Setup Time Position */
#define SERCOM_I2CS_CTRLC_SDASETUP_Msk        (_UINT32_(0xF) << SERCOM_I2CS_CTRLC_SDASETUP_Pos)    /* (SERCOM_I2CS_CTRLC) SDA Setup Time Mask */
#define SERCOM_I2CS_CTRLC_SDASETUP(value)     (SERCOM_I2CS_CTRLC_SDASETUP_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_SDASETUP_Pos)) /* Assignment of value for SDASETUP in the SERCOM_I2CS_CTRLC register */
#define SERCOM_I2CS_CTRLC_DATA32B_Pos         _UINT32_(24)                                         /* (SERCOM_I2CS_CTRLC) Data 32 Bit Position */
#define SERCOM_I2CS_CTRLC_DATA32B_Msk         (_UINT32_(0x1) << SERCOM_I2CS_CTRLC_DATA32B_Pos)     /* (SERCOM_I2CS_CTRLC) Data 32 Bit Mask */
#define SERCOM_I2CS_CTRLC_DATA32B(value)      (SERCOM_I2CS_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_DATA32B_Pos)) /* Assignment of value for DATA32B in the SERCOM_I2CS_CTRLC register */
#define SERCOM_I2CS_CTRLC_FIFOEN_Pos          _UINT32_(27)                                         /* (SERCOM_I2CS_CTRLC) FIFO Enable Position */
#define SERCOM_I2CS_CTRLC_FIFOEN_Msk          (_UINT32_(0x1) << SERCOM_I2CS_CTRLC_FIFOEN_Pos)      /* (SERCOM_I2CS_CTRLC) FIFO Enable Mask */
#define SERCOM_I2CS_CTRLC_FIFOEN(value)       (SERCOM_I2CS_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_FIFOEN_Pos)) /* Assignment of value for FIFOEN in the SERCOM_I2CS_CTRLC register */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_Pos        _UINT32_(28)                                         /* (SERCOM_I2CS_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos)    /* (SERCOM_I2CS_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_I2CS_CTRLC_RXTRHOLD(value)     (SERCOM_I2CS_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos)) /* Assignment of value for RXTRHOLD in the SERCOM_I2CS_CTRLC register */
#define   SERCOM_I2CS_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_I2CS_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_I2CS_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_DEFAULT    (SERCOM_I2CS_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_HALF       (SERCOM_I2CS_CTRLC_RXTRHOLD_HALF_Val << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_FULL       (SERCOM_I2CS_CTRLC_RXTRHOLD_FULL_Val << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_Pos        _UINT32_(30)                                         /* (SERCOM_I2CS_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos)    /* (SERCOM_I2CS_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_I2CS_CTRLC_TXTRHOLD(value)     (SERCOM_I2CS_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos)) /* Assignment of value for TXTRHOLD in the SERCOM_I2CS_CTRLC register */
#define   SERCOM_I2CS_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_I2CS_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_I2CS_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_DEFAULT    (SERCOM_I2CS_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_HALF       (SERCOM_I2CS_CTRLC_TXTRHOLD_HALF_Val << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_EMPTY      (SERCOM_I2CS_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position */
#define SERCOM_I2CS_CTRLC_Msk                 _UINT32_(0xF900000F)                                 /* (SERCOM_I2CS_CTRLC) Register Mask  */


/* -------- SERCOM_SPI_CTRLC : (SERCOM Offset: 0x08) (R/W 32) SPI Control C -------- */
#define SERCOM_SPI_CTRLC_RESETVALUE           _UINT32_(0x00)                                       /*  (SERCOM_SPI_CTRLC) SPI Control C  Reset Value */

#define SERCOM_SPI_CTRLC_ICSPACE_Pos          _UINT32_(0)                                          /* (SERCOM_SPI_CTRLC) Inter-Character Spacing Position */
#define SERCOM_SPI_CTRLC_ICSPACE_Msk          (_UINT32_(0x3F) << SERCOM_SPI_CTRLC_ICSPACE_Pos)     /* (SERCOM_SPI_CTRLC) Inter-Character Spacing Mask */
#define SERCOM_SPI_CTRLC_ICSPACE(value)       (SERCOM_SPI_CTRLC_ICSPACE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_ICSPACE_Pos)) /* Assignment of value for ICSPACE in the SERCOM_SPI_CTRLC register */
#define SERCOM_SPI_CTRLC_FSES_Pos             _UINT32_(8)                                          /* (SERCOM_SPI_CTRLC) Frame Synch Edge Select Position */
#define SERCOM_SPI_CTRLC_FSES_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLC_FSES_Pos)         /* (SERCOM_SPI_CTRLC) Frame Synch Edge Select Mask */
#define SERCOM_SPI_CTRLC_FSES(value)          (SERCOM_SPI_CTRLC_FSES_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_FSES_Pos)) /* Assignment of value for FSES in the SERCOM_SPI_CTRLC register */
#define SERCOM_SPI_CTRLC_FSLEN_Pos            _UINT32_(9)                                          /* (SERCOM_SPI_CTRLC) Frame Synch Length Position */
#define SERCOM_SPI_CTRLC_FSLEN_Msk            (_UINT32_(0x1) << SERCOM_SPI_CTRLC_FSLEN_Pos)        /* (SERCOM_SPI_CTRLC) Frame Synch Length Mask */
#define SERCOM_SPI_CTRLC_FSLEN(value)         (SERCOM_SPI_CTRLC_FSLEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_FSLEN_Pos)) /* Assignment of value for FSLEN in the SERCOM_SPI_CTRLC register */
#define   SERCOM_SPI_CTRLC_FSLEN_STROBE_Val   _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLC) One SCK pulse  */
#define   SERCOM_SPI_CTRLC_FSLEN_LEVEL_Val    _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLC) One frame duration  */
#define SERCOM_SPI_CTRLC_FSLEN_STROBE         (SERCOM_SPI_CTRLC_FSLEN_STROBE_Val << SERCOM_SPI_CTRLC_FSLEN_Pos) /* (SERCOM_SPI_CTRLC) One SCK pulse Position */
#define SERCOM_SPI_CTRLC_FSLEN_LEVEL          (SERCOM_SPI_CTRLC_FSLEN_LEVEL_Val << SERCOM_SPI_CTRLC_FSLEN_Pos) /* (SERCOM_SPI_CTRLC) One frame duration Position */
#define SERCOM_SPI_CTRLC_FSPOL_Pos            _UINT32_(10)                                         /* (SERCOM_SPI_CTRLC) Frame Synch Polarity Position */
#define SERCOM_SPI_CTRLC_FSPOL_Msk            (_UINT32_(0x1) << SERCOM_SPI_CTRLC_FSPOL_Pos)        /* (SERCOM_SPI_CTRLC) Frame Synch Polarity Mask */
#define SERCOM_SPI_CTRLC_FSPOL(value)         (SERCOM_SPI_CTRLC_FSPOL_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_FSPOL_Pos)) /* Assignment of value for FSPOL in the SERCOM_SPI_CTRLC register */
#define   SERCOM_SPI_CTRLC_FSPOL_HIGH_Val     _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLC) VCC-level valid polarity  */
#define   SERCOM_SPI_CTRLC_FSPOL_LOW_Val      _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLC) GND-level valid polarity  */
#define SERCOM_SPI_CTRLC_FSPOL_HIGH           (SERCOM_SPI_CTRLC_FSPOL_HIGH_Val << SERCOM_SPI_CTRLC_FSPOL_Pos) /* (SERCOM_SPI_CTRLC) VCC-level valid polarity Position */
#define SERCOM_SPI_CTRLC_FSPOL_LOW            (SERCOM_SPI_CTRLC_FSPOL_LOW_Val << SERCOM_SPI_CTRLC_FSPOL_Pos) /* (SERCOM_SPI_CTRLC) GND-level valid polarity Position */
#define SERCOM_SPI_CTRLC_IGNTUR_Pos           _UINT32_(11)                                         /* (SERCOM_SPI_CTRLC) Ignore Transmit Underrun Position */
#define SERCOM_SPI_CTRLC_IGNTUR_Msk           (_UINT32_(0x1) << SERCOM_SPI_CTRLC_IGNTUR_Pos)       /* (SERCOM_SPI_CTRLC) Ignore Transmit Underrun Mask */
#define SERCOM_SPI_CTRLC_IGNTUR(value)        (SERCOM_SPI_CTRLC_IGNTUR_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_IGNTUR_Pos)) /* Assignment of value for IGNTUR in the SERCOM_SPI_CTRLC register */
#define SERCOM_SPI_CTRLC_FRMEN_Pos            _UINT32_(16)                                         /* (SERCOM_SPI_CTRLC) Frame mode enable Position */
#define SERCOM_SPI_CTRLC_FRMEN_Msk            (_UINT32_(0x1) << SERCOM_SPI_CTRLC_FRMEN_Pos)        /* (SERCOM_SPI_CTRLC) Frame mode enable Mask */
#define SERCOM_SPI_CTRLC_FRMEN(value)         (SERCOM_SPI_CTRLC_FRMEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_FRMEN_Pos)) /* Assignment of value for FRMEN in the SERCOM_SPI_CTRLC register */
#define SERCOM_SPI_CTRLC_FMODE_Pos            _UINT32_(17)                                         /* (SERCOM_SPI_CTRLC) Frame mode Position */
#define SERCOM_SPI_CTRLC_FMODE_Msk            (_UINT32_(0x1) << SERCOM_SPI_CTRLC_FMODE_Pos)        /* (SERCOM_SPI_CTRLC) Frame mode Mask */
#define SERCOM_SPI_CTRLC_FMODE(value)         (SERCOM_SPI_CTRLC_FMODE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_FMODE_Pos)) /* Assignment of value for FMODE in the SERCOM_SPI_CTRLC register */
#define   SERCOM_SPI_CTRLC_FMODE_MASTER_Val   _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLC) Frame Master  */
#define   SERCOM_SPI_CTRLC_FMODE_SLAVE_Val    _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLC) Frame Slave  */
#define SERCOM_SPI_CTRLC_FMODE_MASTER         (SERCOM_SPI_CTRLC_FMODE_MASTER_Val << SERCOM_SPI_CTRLC_FMODE_Pos) /* (SERCOM_SPI_CTRLC) Frame Master Position */
#define SERCOM_SPI_CTRLC_FMODE_SLAVE          (SERCOM_SPI_CTRLC_FMODE_SLAVE_Val << SERCOM_SPI_CTRLC_FMODE_Pos) /* (SERCOM_SPI_CTRLC) Frame Slave Position */
#define SERCOM_SPI_CTRLC_DATA32B_Pos          _UINT32_(24)                                         /* (SERCOM_SPI_CTRLC) Data 32 Bit Position */
#define SERCOM_SPI_CTRLC_DATA32B_Msk          (_UINT32_(0x1) << SERCOM_SPI_CTRLC_DATA32B_Pos)      /* (SERCOM_SPI_CTRLC) Data 32 Bit Mask */
#define SERCOM_SPI_CTRLC_DATA32B(value)       (SERCOM_SPI_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_DATA32B_Pos)) /* Assignment of value for DATA32B in the SERCOM_SPI_CTRLC register */
#define SERCOM_SPI_CTRLC_FIFOEN_Pos           _UINT32_(27)                                         /* (SERCOM_SPI_CTRLC) FIFO Enable Position */
#define SERCOM_SPI_CTRLC_FIFOEN_Msk           (_UINT32_(0x1) << SERCOM_SPI_CTRLC_FIFOEN_Pos)       /* (SERCOM_SPI_CTRLC) FIFO Enable Mask */
#define SERCOM_SPI_CTRLC_FIFOEN(value)        (SERCOM_SPI_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_FIFOEN_Pos)) /* Assignment of value for FIFOEN in the SERCOM_SPI_CTRLC register */
#define SERCOM_SPI_CTRLC_RXTRHOLD_Pos         _UINT32_(28)                                         /* (SERCOM_SPI_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_SPI_CTRLC_RXTRHOLD_Msk         (_UINT32_(0x3) << SERCOM_SPI_CTRLC_RXTRHOLD_Pos)     /* (SERCOM_SPI_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_SPI_CTRLC_RXTRHOLD(value)      (SERCOM_SPI_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_RXTRHOLD_Pos)) /* Assignment of value for RXTRHOLD in the SERCOM_SPI_CTRLC register */
#define   SERCOM_SPI_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_SPI_CTRLC_RXTRHOLD_HALF_Val  _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_SPI_CTRLC_RXTRHOLD_FULL_Val  _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_SPI_CTRLC_RXTRHOLD_DEFAULT     (SERCOM_SPI_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_SPI_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position */
#define SERCOM_SPI_CTRLC_RXTRHOLD_HALF        (SERCOM_SPI_CTRLC_RXTRHOLD_HALF_Val << SERCOM_SPI_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position */
#define SERCOM_SPI_CTRLC_RXTRHOLD_FULL        (SERCOM_SPI_CTRLC_RXTRHOLD_FULL_Val << SERCOM_SPI_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position */
#define SERCOM_SPI_CTRLC_TXTRHOLD_Pos         _UINT32_(30)                                         /* (SERCOM_SPI_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_SPI_CTRLC_TXTRHOLD_Msk         (_UINT32_(0x3) << SERCOM_SPI_CTRLC_TXTRHOLD_Pos)     /* (SERCOM_SPI_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_SPI_CTRLC_TXTRHOLD(value)      (SERCOM_SPI_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLC_TXTRHOLD_Pos)) /* Assignment of value for TXTRHOLD in the SERCOM_SPI_CTRLC register */
#define   SERCOM_SPI_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_SPI_CTRLC_TXTRHOLD_HALF_Val  _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_SPI_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is empty  */
#define SERCOM_SPI_CTRLC_TXTRHOLD_DEFAULT     (SERCOM_SPI_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_SPI_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position */
#define SERCOM_SPI_CTRLC_TXTRHOLD_HALF        (SERCOM_SPI_CTRLC_TXTRHOLD_HALF_Val << SERCOM_SPI_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position */
#define SERCOM_SPI_CTRLC_TXTRHOLD_EMPTY       (SERCOM_SPI_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_SPI_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPI_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is empty Position */
#define SERCOM_SPI_CTRLC_Msk                  _UINT32_(0xF9030F3F)                                 /* (SERCOM_SPI_CTRLC) Register Mask  */


